Revit 2026 API

# StairsPathCreate Method

---

Creates a new stairs path for the specified stairs with the specified stairs path type only in the plan view.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static StairsPath Create(
	Document document,
	LinkElementId stairsId,
	ElementId typeId,
	ElementId planViewId
)
```
```vb
Public Shared Function Create (
	document As Document,
	stairsId As LinkElementId,
	typeId As ElementId,
	planViewId As ElementId
) As StairsPath
```
```cpp
public:
static StairsPath^ Create(
	Document^ document,
	LinkElementId^ stairsId,
	ElementId^ typeId,
	ElementId^ planViewId
)
```
```fsharp
static member Create :
        document : Document *
        stairsId : LinkElementId *
        typeId : ElementId *
        planViewId : ElementId -> StairsPath
```

#### Parameters

document Document
     The document.
stairsId LinkElementId
     The id of the stairs element either in the host document or in a linked document.
typeId ElementId
     The type of stairs path.
planViewId ElementId
     The plan view in which the stairs path will be shown.

#### Return Value

StairsPath The new stairs path.

| Exception | Condition |
| --- | --- |
| ArgumentException | The stairsId is not a valid stairs. -or- The typeId is not a valid stairs path type. -or- The planViewId is not a valid plan view. -or- The stairsId already has a stairs path. -or- The stairsId is not visible in planViewId. |
| ArgumentNullException | A non-optional argument was null |

#### Reference

StairsPath Class

Autodesk.Revit.DB.Architecture Namespace